In [42]:
import numpy as np
import pandas as pd

In [43]:
labels = ["Dishwasher", "Laptop", "Iphone"]
prices = [399, 129, 123]

# combine two lists into one using a pandas series
ser1 = pd.Series(prices, labels)
ser1.to_frame()

              0
Dishwasher  399
Laptop      129
Iphone      123

In [44]:
d = {"a": 19, "b": 20, "c": 21}
ser1 = pd.Series(d)
ser1.to_frame()

    0
a  19
b  20
c  21

In [45]:
# combine 2 series
ser1 = pd.Series([1, 2, 3, 4], ["Finland", "Portugal", "Norwegian", "Denmark"])
ser2 = pd.Series([1, 2, 3, 4], ["Oulu", "Lisbon", "Norwegian", "Denmark"])
combined = ser1 + ser2
combined.to_frame()

# we have NaN because text + number

             0
Denmark    8.0
Finland    NaN
Lisbon     NaN
Norwegian  6.0
Oulu       NaN
Portugal   NaN

In [46]:
from numpy.random import randint
np.random.seed(321)

In [47]:
companies = ["Lazy", "Piggy bank", "Walmart", "Lapin AMK Tequila"]
countries = ["Europe", "North_America", "South_America", "Asia", "Africa", "Other"]
numbers = randint(99999, size = (4, 6))
df = pd.DataFrame(numbers, companies, countries)
df

                   Europe  North_America  South_America   Asia  Africa  Other
Lazy                97268           6682           4220  43807    5929  91537
Piggy bank          24744          69018          99288  14068   90469  94536
Walmart             28243          44245          21633  78619   45594  37389
Lapin AMK Tequila   57643          46518          71742  99722   48613  97335

In [48]:
col_df = df["Europe"]
col_df.to_frame()

                   Europe
Lazy                97268
Piggy bank          24744
Walmart             28243
Lapin AMK Tequila   57643

In [49]:
cols_df = df[["North_America", "South_America"]]
cols_df

                   North_America  South_America
Lazy                        6682           4220
Piggy bank                 69018          99288
Walmart                    44245          21633
Lapin AMK Tequila          46518          71742

In [50]:
df["Both_Americas"] = df["North_America"] + df["South_America"]
df.to_frame()

AttributeError: 'DataFrame' object has no attribute 'to_frame'

In [ ]:
# axis = 0 or default is row, axis = 1 is column
df = df.drop("Both_Americas", axis = 1)

In [ ]:
df

In [ ]:
df['Both_Americas'] = df['North_America'] + df['South_America']
df

In [ ]:
# drop one of the columns
df = df.drop("North_America", axis=1)

In [ ]:
# drop one of the columns
df = df.drop("Lazy")

In [ ]:
df = df.drop("Lazy")

In [ ]:
df

In [ ]:
row = df.iloc[2]
row.to_frame().transpose()

In [ ]:
df

In [ ]:
df = df.drop("Both_Americas", axis = 1)

In [53]:
df

,Europe,North_America,South_America,Asia,Africa,Other,Both_Americas
Lazy,97268,6682,4220,43807,5929,91537,10902
Piggy bank,24744,69018,99288,14068,90469,94536,168306
Walmart,28243,44245,21633,78619,45594,37389,65878
Lapin AMK Tequila,57643,46518,71742,99722,48613,97335,118260

In [52]:
# to filter info
resultdf = df[df["Europe"]>40000]
resultdf

,Europe,North_America,South_America,Asia,Africa,Other,Both_Americas
Lazy,97268,6682,4220,43807,5929,91537,10902
Lapin AMK Tequila,57643,46518,71742,99722,48613,97335,118260

In [54]:
filtered1 = resultdf["Asia"]
filtered1.to_frame()

                    Asia
Lazy               43807
Lapin AMK Tequila  99722

In [55]:
# to filter info
resultdf = df[df["Europe"]>4000]
resultdf

,Europe,North_America,South_America,Asia,Africa,Other,Both_Americas
Lazy,97268,6682,4220,43807,5929,91537,10902
Piggy bank,24744,69018,99288,14068,90469,94536,168306
Walmart,28243,44245,21633,78619,45594,37389,65878
Lapin AMK Tequila,57643,46518,71742,99722,48613,97335,118260

In [56]:
# to filter info
resultdf = df[df["Europe"]>40000]
resultdf["Europe"].to_frame()

                   Europe
Lazy                97268
Lapin AMK Tequila   57643

In [57]:
# two conditions at the same time
test_condition = df[(df["Europe"]>30000)&(df["Africa"]>20000)]
test_condition

,Europe,North_America,South_America,Asia,Africa,Other,Both_Americas
Lapin AMK Tequila,57643,46518,71742,99722,48613,97335,118260